bench_result/value-1024_mem-16777216.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=1024 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=16777216 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-1024_mem-16777216.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     1024 bytes each (512 bytes after compression)
Entries:    1000000
RawSize:    991.8 MB (estimated)
FileSize:   503.5 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 8.78817 GB
fillrandom   :       2.569 micros/op;  386.1 MB/s 2.57 s

write in SSD size (MB):348.923
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2       32         1        0      1042
  1        1       32         0        0        15
  2        5      320         0        0        14

readrandom   :       1.821 micros/op;  544.8 MB/s (1000000 of 1000000 found) 1.82 s

write in SSD size (MB):453.634
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       16         1        0      1058
  1        2       64         0        0        15
  2        2      128         0        0        14

pmem allocs 804551
Final Use NVM: 0.203127 GB
Remainder of NVM space : 7.77229 GB