bench_result/value-1024_mem-4194304.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=1024 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=4194304 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-1024_mem-4194304.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     1024 bytes each (512 bytes after compression)
Entries:    1000000
RawSize:    991.8 MB (estimated)
FileSize:   503.5 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 9.32655 GB
fillrandom   :       2.575 micros/op;  385.2 MB/s 2.58 s

write in SSD size (MB):428.664
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1        4         1        0      1054
  1        3       24         0        0        15
  2       15      240         0        0        15

readrandom   :       1.741 micros/op;  569.8 MB/s (1000000 of 1000000 found) 1.74 s

write in SSD size (MB):553.715
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2        8         1        0      1058
  1        1        8         0        0        15
  2        2       32         0        0        15

pmem allocs 978942
Final Use NVM: 0.0468802 GB
Remainder of NVM space : 8.30994 GB