bench_result/value-1024_mem-67108864.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=1024 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=67108864 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-1024_mem-67108864.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     1024 bytes each (512 bytes after compression)
Entries:    1000000
RawSize:    991.8 MB (estimated)
FileSize:   503.5 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 8.39955 GB
fillrandom   :       2.866 micros/op;  346.0 MB/s 2.87 s

write in SSD size (MB):0
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2      128         0        0      1042
  1        1      128         0        0        13
  2        3      768         0        0        11

readrandom   :       2.226 micros/op;  429.7 MB/s (964452 of 1000000 found) 2.23 s

write in SSD size (MB):127.517
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2      128         0        0      1042
  1        1      128         0        0        13
  2        2      512         0        0        11

pmem allocs 234776
Final Use NVM: 0.750011 GB
Remainder of NVM space : 7.39949 GB