bench_result/value-1024_mem-8388608.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=1024 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=8388608 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-1024_mem-8388608.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     1024 bytes each (512 bytes after compression)
Entries:    1000000
RawSize:    991.8 MB (estimated)
FileSize:   503.5 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 9.05499 GB
fillrandom   :       2.551 micros/op;  388.8 MB/s 2.55 s

write in SSD size (MB):407.453
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1        8         1        0      1050
  1        2       32         0        0        15
  2        8      256         0        0        15

readrandom   :       1.828 micros/op;  542.5 MB/s (1000000 of 1000000 found) 1.83 s

write in SSD size (MB):513.806
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2       16         1        0      1058
  1        2       32         0        0        15
  2        2       64         0        0        15

pmem allocs 909612
Final Use NVM: 0.10938 GB
Remainder of NVM space : 8.03886 GB