bench_result/value-128_mem-16777216.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=128 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=16777216 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-128_mem-16777216.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000
RawSize:    137.3 MB (estimated)
FileSize:   76.3 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 8.51064 GB
fillrandom   :       2.028 micros/op;   67.7 MB/s 2.03 s

write in SSD size (MB):0
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       16         0        0       193
  1        3       96         0        0        13
  2        1       64         0        0         5

readrandom   :       1.994 micros/op;   68.9 MB/s (1000000 of 1000000 found) 1.99 s

write in SSD size (MB):0
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       16         0        0       193
  1        1       32         0        0        13
  2        2      128         0        0        11

pmem allocs 2
Final Use NVM: 0.171877 GB
Remainder of NVM space : 8.33827 GB