bench_result/value-128_mem-2097152.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=128 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=2097152 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-128_mem-2097152.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000
RawSize:    137.3 MB (estimated)
FileSize:   76.3 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 6.65585 GB
fillrandom   :       1.941 micros/op;   70.8 MB/s 1.94 s

write in SSD size (MB):52.9643
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2        4         0        0       202
  1        1        4         0        0        15
  2       10       80         0        0        15

readrandom   :       1.854 micros/op;   74.1 MB/s (1000000 of 1000000 found) 1.85 s

write in SSD size (MB):88.2938
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2        4         0        0       202
  1        1        4         0        0        15
  2        2       16         0        0        15

pmem allocs 873870
Final Use NVM: 0.0234393 GB
Remainder of NVM space : 6.47581 GB